nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/sensors/drv_camera_int.c
    if (rt_i2c_transfer(i2c_bus, msgs, 2) != 0)
    {
		*reg_data = buf[3] | (buf[2] << 8);
        return 0 ;
    }
    else
    {
		cam_err("[%s] error\r\n",__func__);
        return -1;
    }
}


int imxrt_camera_set_framerate(struct imxrt_camera *cam,int framerate)
{
    if (cam->sensor.framerate == framerate) {
       /* no change */
        return 0;
    }
#ifdef 	SOC_IMXRT1170_SERIES
#else		
	if ((framerate & 0x80000000) && (cam->sensor_id == OV7725_ID))
		CCM->CSCDR3 = framerate & (0x1F<<9);
#endif
    /* call the sensor specific function */
    if (cam->sensor.set_framerate == NULL
        || cam->sensor.set_framerate(&cam->sensor, framerate) != 0) {
        /* operation not supported */
        return -1;
    }

    /* set the frame rate */
    cam->sensor.framerate = framerate;

    return 0;
}

extern void BOARD_Camera_pwd_io_set(int value);
extern void BORAD_Camera_rst_io_set(int value);

bool imx_cam_sensor_init(struct imxrt_camera *cam)
{
	struct rt_i2c_bus_device *i2c_bus;
	

	
	i2c_bus = rt_i2c_bus_device_find((const char *)cam->sensor_bus_name);
	if(i2c_bus == RT_NULL)
	{
		cam_err("[%s]driver can not find %s bus\r\n",__func__,cam->sensor_bus_name);
		return false;
	} 
	
	CLOCK_SetMux(kCLOCK_CsiMux, 0);
	CLOCK_SetDiv(kCLOCK_CsiDiv, 0);
	CLOCK_EnableClock(kCLOCK_Csi);
	cam_err("csi root clk:%d\r\n",CLOCK_GetClockRootFreq(kCLOCK_CsiClkRoot));
	for (int i=0; i< 3;i++)
	{
		cam->sensor.i2c_bus = (uint32_t *)i2c_bus;
		cam->sensor.cambus_readb = imx_cam_sensor_cambus_readb;
		cam->sensor.cambus_writeb = imx_cam_sensor_cambus_writeb;
		cam->sensor.cambus_readw = imx_cam_sensor_cambus_readw;
		cam->sensor.cambus_writew = imx_cam_sensor_cambus_writew;
		cam->sensor.cambus_readb2 = imx_cam_sensor_cambus_readb2;
		cam->sensor.cambus_writeb2 = imx_cam_sensor_cambus_writeb2;
		cam->sensor.cambus_writews = imx_cam_sensor_cambus_writews;
		cam->sensor.cambus_readws = imx_cam_sensor_cambus_readws;
		cam->sensor_addr = supported_sensors[i][0];
		cam->sensor.slv_addr = cam->sensor_addr;

		
		//reset camera
		//power down to low
		BOARD_Camera_pwd_io_set(0);
		//reset 
		BORAD_Camera_rst_io_set(0);
		rt_thread_delay(50);
		BORAD_Camera_rst_io_set(1);
		rt_thread_delay(50);

		//read 2 bytes first for mt9m114
		uint16_t sensor_id_s = 0;
		uint8_t sensor_id = 0;
		if(imx_cam_sensor_cambus_readw2(&cam->sensor,cam->sensor_addr,supported_sensors[i][1], &sensor_id_s) == 0)
		{//two bytes addr, two bytes value
			if(sensor_id_s == MT9M114_ID)
			{
				cam_err("Camera Device id:0x%x\r\n",sensor_id_s);
				mt9m114_init(&cam->sensor);
				cam->sensor_id = MT9M114_ID;
				return true;
			}
		}
		
		if (imx_cam_sensor_readb2_reg(i2c_bus,cam->sensor_addr,supported_sensors[i][1], &sensor_id) == 0)
		{//two byte addr, one bytes value
			if(sensor_id == OV5640_ID)
			{
				cam_err("Camera Device id:0x%x\r\n",sensor_id);
				#ifdef SENSOR_OV5640
				ov5640_init(&cam->sensor);
				#endif
				cam->sensor_id = OV5640_ID;
				return true;
			}
		}
		
		if (imx_cam_sensor_read_reg(i2c_bus,cam->sensor_addr,OV_CHIP_ID, &sensor_id) == 0)
		{//one byte addr. one byte value
			switch(sensor_id)
			{

				case OV9650_ID:
					cam_err("Camera Device id:0x%x\r\n",sensor_id);
					#ifdef SENSOR_OV9650
					ov9650_init(&cam->sensor);
					#endif
					cam->sensor_id = OV9650_ID;
					return true;
				case OV2640_ID:
					cam_err("Camera Device id:0x%x\r\n",sensor_id);
					#ifdef SENSOR_OV2640
					ov2640_init(&cam->sensor);
					#endif
					cam->sensor_id = OV2640_ID;
					return true;
				case OV7725_ID:
					cam_err("Camera Device id:0x%x\r\n",sensor_id);
					#ifdef SENSOR_OV7725
					ov7725_init(&cam->sensor);
					cam->sensor_id = OV7725_ID;
					imxrt_camera_set_framerate(cam,0x80000000 | (2<<9|(8-1)<<11));
					#endif
					
					return true;
				default:
					
					break;
			}
		
		}
	}
	cam_err("[%s] sensor id:0x%2x not support\r\n",__func__,cam->sensor_id);
	return false;
}



void imx_cam_reset(struct imxrt_camera *cam)
{
	mutex_init0(&JPEG_FB()->lock);
	//sensor init
	imx_cam_sensor_init(cam);
	//csi init
	CsiFragModeInit(cam->csi_base);
	csi_calc_first = 0;
	cam->sensor.isWindowing = 0;
	cam->sensor.wndH = cam->sensor.fb_h;
	cam->sensor.wndW = cam->sensor.fb_w;
	cam->sensor.wndX = cam->sensor.wndY = 0;	
	
	cam->sensor.sde          = 0xFF;
    cam->sensor.pixformat    = 0xFF;
    cam->sensor.framesize    = 0xFF;
    cam->sensor.framerate    = 0xFF;
    cam->sensor.gainceiling  = 0xFF;


    // Call sensor-specific reset function; in the moment,we use our init function and defaults regs
    if (cam->sensor.reset)
		cam->sensor.reset(&cam->sensor);
}



#if defined(__CC_ARM)
#define ARMCC_ASM_FUNC	__asm
ARMCC_ASM_FUNC __attribute__((section(".ram_code"))) uint32_t ExtractYFromYuv(uint32_t dmaBase, uint32_t datBase, uint32_t _128bitUnitCnt) {
	push	{r4-r7, lr}
10
	LDMIA	R0!, {r3-r6}
	// schedule code carefully to allow dual-issue on Cortex-M7
	bfi		r7, r3, #0, #8	// Y0
	bfi		ip, r5, #0, #8	// Y4
	lsr		r3,	r3,	#16
	lsr		r5,	r5,	#16
	bfi		r7, r3, #8, #8	// Y1
	bfi		ip, r5, #8, #8  // Y5
	bfi		r7, r4, #16, #8 // Y2
	bfi		ip, r6, #16, #8 // Y6
	lsr		r4,	r4,	#16
	lsr		r6,	r6,	#16
	bfi		r7, r4, #24, #8 // Y3
	bfi		ip, r6, #24, #8	// Y7
	STMIA	r1!, {r7, ip}
	
	subs	r2,	#1
	bne		%b10
	mov		r0,	r1
	pop		{r4-r7, pc}
}
#elif defined(__CLANG_ARM)
__attribute__((section(".ram_code")))
__attribute__((naked))  uint32_t ExtractYFromYuv(uint32_t dmaBase, uint32_t datBase, uint32_t _128bitUnitCnt) {
		__asm volatile (
		"	push	{r1-r7, ip, lr}  \n "
		"10:  \n "
		"	ldmia	r0!, {r3-r6}  \n "
			// schedule code carefully to allow dual-issue on Cortex-M7
		"	bfi		r7, r3, #0, #8  \n "	// Y0
		"	bfi		ip, r5, #0, #8  \n "	// Y4
		"	lsr		r3,	r3,	#16  \n "
		"	lsr		r5,	r5,	#16  \n "
		"	bfi		r7, r3, #8, #8  \n "	// Y1
		"	bfi		ip, r5, #8, #8  \n "  // Y5
		"	bfi		r7, r4, #16, #8  \n " // Y2
		"	bfi		ip, r6, #16, #8  \n " // Y6
		"	lsr		r4,	r4,	#16  \n "
		"	lsr		r6,	r6,	#16  \n "
		"	bfi		r7, r4, #24, #8  \n " // Y3
		"	bfi		ip, r6, #24, #8  \n "	// Y7
		"	stmia	r1!, {r7, ip}  \n "	
		"	subs	r2,	#1  \n "
		"	bne		10b  \n "
		"	mov		r0,	r1  \n "
		"	pop		{r1-r7, ip, pc}  \n "		
	);
}
#else
__attribute__((naked))
__attribute__((section(".ram_code"))) uint32_t ExtractYFromYuv(uint32_t dmaBase, uint32_t datBase, uint32_t _128bitUnitCnt) {
	__asm volatile (
		"	push	{r1-r7, ip, lr}  \n "
		"10:  \n "
		"	ldmia	r0!, {r3-r6}  \n "
			// schedule code carefully to allow dual-issue on Cortex-M7
		"	bfi		r7, r3, #0, #8  \n "	// Y0
		"	bfi		ip, r5, #0, #8  \n "	// Y4
		"	lsr		r3,	r3,	#16  \n "
		"	lsr		r5,	r5,	#16  \n "
		"	bfi		r7, r3, #8, #8  \n "	// Y1
		"	bfi		ip, r5, #8, #8  \n "  // Y5
		"	bfi		r7, r4, #16, #8  \n " // Y2
		"	bfi		ip, r6, #16, #8  \n " // Y6
		"	lsr		r4,	r4,	#16  \n "
		"	lsr		r6,	r6,	#16  \n "
		"	bfi		r7, r4, #24, #8  \n " // Y3
		"	bfi		ip, r6, #24, #8  \n "	// Y7
		"	stmia	r1!, {r7, ip}  \n "	
		"	subs	r2,	#1  \n "
		"	bne		10b  \n "
		"	mov		r0,	r1  \n "
		"	pop		{r1-r7, ip, pc}  \n "		
	);
}

#endif

__attribute__((section(".ram_code")))
__attribute__((naked)) void rgb32Torgb565(uint32_t *src, uint16_t *dst, uint32_t len){
	__asm volatile(
		"push {r3-r8, lr}\n"
		"loop: \n"
		"mov r8, #0\n"
		"ldrd r3,r4, [r0], #8\n"
	
